[InteractiveObjects.IO_Overlooked2_ShieldEssenceSpawn InteractiveObjectDefinition]
StatusMenuMapInfoBoxHeader=""
StatusMenuMapInfoBoxDescription=""

[IO_ShieldPartsDelivery InteractiveObjectDefinition]
StatusMenuMapInfoBoxHeader=""
StatusMenuMapInfoBoxDescription=""

[ItemDefs.ID_MO_Overlooked2_ShieldEssence MissionItemDefinition]
UseFailureCharacterMessage="É preciso ser %s para usar esse item."
ItemName="Núcleo de Escudo Digitalizado"
PickupMessage="Você tem %s"
UseFailureLevelMessage="Você deve estar, pelo menos no nível %d para usar esse item."
UseFailureConstraintsMessage="Você não pode usar esse item."
NoManufacturerName="Genérico"

[ItemDefs.ID_MO_Overlooked2_ShieldEssence:AttributePresentationDefinition_0 AttributePresentationDefinition]
Description="A parte do escudo que protege."
NoConstraintText=""
Suffix=""
Prefix=""

[Population.PawnBalance_OverlookGuard AIPawnBalanceDefinition]
PlayThroughs[0]=(DisplayName="Guarda da Hyperion")

